Revit 2015 API
InstanceArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual InstanceArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As InstanceArrayIterator
Visual C++
public:
virtual InstanceArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
InstanceArray Class
Autodesk.Revit.DB Namespace